[Cues]
Act_E3_1C_CampusA_ChloeFearsMax_VoiceOver01_Max_010="Chloe better not have flaked... or worse, got busted by David... After what happened with Kate, I can't take any more bad news this year..."
Act_E3_1C_CampusA_ChloeFearsMax_VoiceOver02_Max_010="Chloe better not have flaked... or worse, got busted by David... I don't think the universe is going to let me rescue Chloe one more time..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_037="Oh yeah, and somehow stop that tornado from wiping out Arcadia Bay... right?"
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_041="This whole town is a bad omen. And notice that Blackwell seems to be ground zero?"
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_042="Max, I'm not laughing at you. My old counselor told me that my sarcasm was a way of "avoidance." That's why he's my ex-counselor."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_043="Oh right, except for your ability to, oh yeah, manipulate time and space. No biggie."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_052="Dude, do not even torture yourself like that. Let's focus on looking for clues, okay?"
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_053="Like step-prick and Nathan Prescott?"
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_054="She was able to blend in with everybody. Even with people I hated."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_061="More like psychopaths. The Blackwell Security Officer even hits his own stepdaughter..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_062="Yep... I just want to beat the shit out of those particular bros..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_063="Yep... I just want to beat the shit out of those particular bros... I can still feel David's hand on my face..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_064="Fuck the truth, I just want to find my friend right now... It scares me to think where she could be... Do you think she's..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_068="Not as much as I hate thinking it. Max, we have to find Rachel soon. We have to..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_069="Maybe too much power. Max, we have to find Rachel soon. We have to..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_070="She wouldn't leave without me, okay? And how often do missing girls turn up? We have to find Rachel soon. We have to..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Chloe_071="More like psychopaths. At least David doesn't try to beat down women like Nathan..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_035="And find out who really killed Kate. We have to stop this from happening to anybody else."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_036="And find out who almost killed Kate. We have to stop this from happening to anybody else."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_038="I hope so, Chloe... but how? Snow and eclipse are bad omens."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_039="Please don't joke about this, Chloe. Not right now."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_040="Didn't you say that it was all about "Chaos Theory"? I don't see any control over this chaos..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_044="Chloe, I just feel weird about some of my decisions..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_046="Especially after I just got Nathan expelled..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_047="Especially after I see the results... and then it's too late to rewind."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_048="Especially after I just got your step-bully suspended..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_050="Especially after I just got Mr. Jefferson in trouble..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_051="I mean, I even got my own dumb ass suspended..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_055="Right, for one thing, there's too much coincidence between the people around Kate and Rachel."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_056="We need to find out more about who Rachel was involved with around here."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_057="I promise you we will. Like you said, it's time to start the search for clues. Now tell me, what's your secret?"
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_058="And even though I don't know her, it feels like Rachel is guiding us to the truth..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_059="Of course. They're both sociopaths."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_060="Not just them."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_065="Dead? I'm sorry, I hate even saying that, Chloe."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_066="Alive? I have to think that, Chloe. Her spirit is so powerful here..."
Cue_E3_1C_CampusA_CHChloeDial_MaxChloe01_Max_067="Kicking it in Los Angeles? That would be the best-case scenario..."
Cue_E3_1C_CampusA_ChloeFearsMax_Chloe_010="BOO-YAH!"
Cue_E3_1C_CampusA_ChloeFearsMax_Chloe_020="Get it, BOO-yah? Like I'm a scary punk ghost..."
Cue_E3_1C_CampusA_ChloeFearsMax_Chloe_040="I'm—I'm sorry, Max. I... I wasn't even thinking. I suck."
Cue_E3_1C_CampusA_ChloeFearsMax_Chloe_060="I know seeing Kate fall was horrible. I don't even know how to deal with that, so I just... act like an idiot. But it's your badass power that's going to bring all this to a close. We just need to connect the players."
Cue_E3_1C_CampusA_ChloeFearsMax_Chloe_080="Sorry, but you absolutely balls to the walls did save your friend!"
Cue_E3_1C_CampusA_ChloeFearsMax_Chloe_100="Don't be so modest, rock star. Kate is alive because of you. You obviously said the right thing... And your badass power is going to save us all. We just need to connect the players."
Cue_E3_1C_CampusA_ChloeFearsMax_Max_030="More like a scary insensitive asshole. Chloe, I watched my friend jump off a roof today. I don't think you need to prank me tonight. You always trip out on me for not being there for you but... is this how you're there for me?"
Cue_E3_1C_CampusA_ChloeFearsMax_Max_050="I'm not trying to be a bitch but... I'll never get the image out of my head of Kate jumping off that roof... All because my power didn't work... It didn't mean shit."
Cue_E3_1C_CampusA_ChloeFearsMax_Max_070="More like a scary punk asshole. Hey Chloe, I didn't exactly have the greatest day trying to keep my friend from jumping off the roof. I don't think I need you to prank me tonight, 'kay?"
Cue_E3_1C_CampusA_ChloeFearsMax_Max_090="Kate saved herself. I couldn't even use my power... my head felt like it was being crushed... Then I had no clue what to say to her on that roof..."
Cue_E3_1C_CampusA_ChloeShowsKeys_Chloe_010="Drum roll please... I present the spare keys to Blackwell. Thank you, step-prick. "
Cue_E3_1C_CampusA_ChloeShowsKeys_Chloe_030="Look at all the trouble dropping in Arcadia Bay. At this point, who gives a fuck anymore? You're suspended anyway, Max. Lead the way."
Cue_E3_1C_CampusA_ChloeShowsKeys_Chloe_040="Look at all the trouble dropping in Arcadia Bay. At this point, who gives a fuck anymore? We're in it to win it, Max. Lead the way..."
Cue_E3_1C_CampusA_ChloeShowsKeys_Chloe_060="As long as you're my partner in time."
Cue_E3_1C_CampusA_ChloeShowsKeys_Max_020="You are such a boss, Chloe. I just don't want you to get into any more trouble..."
Cue_E3_1C_CampusA_ChloeShowsKeys_Max_050="I'm so glad you're my partner in crime."
Cue_E3_1C_CampusA_ChloeShowsKeys_Max_070="Insert groan here..."
Cue_E3_1C_CampusA_EnteringBuilding_Chloe_010="Oh, it is on like Donkey Kong."
Cue_E3_1C_CampusA_JeffersonVictoria_Chloe_340="No doubt. She has Jefferson by the balls."
Cue_E3_1C_CampusA_JeffersonVictoria_Chloe_360="Shit is about to get real at Blackwell."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_020="Hopefully the rest of the class will follow your lead. I'm sorry I was distracted. As you know, it has not been a good day for Blackwell."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_040="Thank you, Victoria. I imagine you're pretty upset over Kate as well..."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_070="Thank you, Victoria. I'm glad it had a relatively happy ending."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_090=""Katie"? I had no idea you two were that close... did she?"
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_110="It doesn't. The contest is still a go and I still have to pick the winner to best represent Blackwell. I've got all the photos except one from Max..."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_120="The contest will go on, I just won't be representing Blackwell at the event this year thanks to Max, who claims I enabled Kate Marsh's trouble by merely listening to her."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_140="I guess you would know all about that, Victoria."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_160="Yes, Max is famous for her bullying. Come on, Victoria."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_200="Who isn't David Madsen investigating?"
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_220="Officially placed on leave. But I'm not shedding any tears."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_240="Once I get Max's photo, I'll start the process."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_260="Stick to Mr. Jefferson, Victoria. Please? And, uh... I haven't picked a winner yet."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_270="Stick to Mr. Jefferson, Victoria. I won't be going to San Francisco, remember?"
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_290="I'm going to think that you didn't say any of that."
Cue_E3_1C_CampusA_JeffersonVictoria_Jefferson_310="As a favor to your future, I'll also ignore that undisguised threat. This conversation is officially over, Miss Chase, I suggest you go back to your dorm now."
Cue_E3_1C_CampusA_JeffersonVictoria_Max_330="Just when I think Victoria can't get any more evil."
Cue_E3_1C_CampusA_JeffersonVictoria_Max_350="No wonder they call it the Vortex Club..."
Cue_E3_1C_CampusA_JeffersonVictoria_Max_370="Let's go find out."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_010="Thank you again so much for helping me put together a portfolio."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_030="I know this has been an awful day and you can talk to me anytime, Mr. Jefferson."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_050="I'm, like, still in shock. I've never seen anybody die. I really cared about Katie."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_060="I know this has been a stressful day if you want to talk about it, Mr. Jefferson."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_080="I don't know what I would have done if Katie jumped..."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_100="Well... how does this affect the "Everyday Heroes" contest?"
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_130="I hate Max Caulfield. Can't you see how phony she is with her "Oh, I'm so shy and fragile" crap? She's a total drama queen."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_150="Max got suspended, not me. And I bet she was probably teasing Kate on that roof..."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_170="All I know is that Max took a photo of me when Samuel spilled paint on me the other day... Why should anybody trust her?"
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_180="Okay, I do know she was nice when Samuel spilled paint on me the other day... I'm shocked she didn't take a picture to humiliate me..."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_190="I heard David Madsen is investigating her..."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_210="I heard she got David Madsen fired."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_230="So you haven't picked a winner for the contest then?"
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_250="I'll give you a one-word sneak preview of Max's photo—selfie. Listen, you've seen my entry, you know it's better than that. Wouldn't that be so cool to hang out together in San Francisco, Mark?"
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_280="You already love my work, so it's not like you're playing favorites. Just imagine if you picked my photo though... we would have to spend a lot of time together. That could be... fun, don't you think?"
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_300="You might as well choose me... otherwise I might have to tell people you offered to choose my photo for favors or something..."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_320="Wait, I only..."
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_330="Are you fucking kidding me?"
Cue_E3_1C_CampusA_JeffersonVictoria_Victoria_340="That's so stupid!"
